## Production: api
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 6 to add, 0 to change, 5 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                                NAME                                                 |
|----------|-----------------------------------------------------------------------------------------------------|
| recreate | `module.sentinel_forwarder.aws_iam_policy.sentinel_forwarder_lambda`                                |
|          | `module.sentinel_forwarder.aws_iam_role.sentinel_forwarder_lambda`                                  |
|          | `module.sentinel_forwarder.aws_iam_role_policy_attachment.sentinel_forwarder_lambda`                |
|          | `module.sentinel_forwarder.aws_lambda_function.sentinel_forwarder`                                  |
|          | `module.sentinel_forwarder.aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[0]` |
| add      | `module.sentinel_forwarder.aws_cloudwatch_log_group.sentinel_forwarder_lambda`                      |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.sentinel_forwarder.data.aws_iam_policy_document.sentinel_forwarder_lambda will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "sentinel_forwarder_lambda" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "xray:GetSamplingRules",
              + "xray:GetSamplingStatisticSummaries",
              + "xray:GetSamplingTargets",
              + "xray:PutTelemetryRecords",
              + "xray:PutTraceSegments",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
    }

  # module.sentinel_forwarder.aws_cloudwatch_log_group.sentinel_forwarder_lambda will be created
  + resource "aws_cloudwatch_log_group" "sentinel_forwarder_lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/github-secret-scanning-sentinel"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags              = {
          + "CostCentre" = "github-secret-scanning-production"
        }
      + tags_all          = {
          + "CostCentre" = "github-secret-scanning-production"
        }
    }

  # module.sentinel_forwarder.aws_iam_policy.sentinel_forwarder_lambda must be replaced
-/+ resource "aws_iam_policy" "sentinel_forwarder_lambda" {
      ~ arn       = "arn:aws:iam::283582579564:policy/SentinelForwarderLambda-github-secret-scanning" -> (known after apply)
      ~ id        = "arn:aws:iam::283582579564:policy/SentinelForwarderLambda-github-secret-scanning" -> (known after apply)
      ~ name      = "SentinelForwarderLambda-github-secret-scanning" -> "SentinelForwarderLambda-github-secret-scanning-sentinel" # forces replacement
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:ca-central-1:283582579564:log-group:/aws/lambda/github-secret-scanning:*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "xray:PutTraceSegments",
                          - "xray:PutTelemetryRecords",
                          - "xray:GetSamplingTargets",
                          - "xray:GetSamplingStatisticSummaries",
                          - "xray:GetSamplingRules",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ policy_id = "ANPAUEBWWYNWN2ZPEPQ5E" -> (known after apply)
      - tags      = {} -> null
      ~ tags_all  = {} -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.sentinel_forwarder.aws_iam_role.sentinel_forwarder_lambda must be replaced
-/+ resource "aws_iam_role" "sentinel_forwarder_lambda" {
      ~ arn                   = "arn:aws:iam::283582579564:role/SentinelForwarderLambda-github-secret-scanning" -> (known after apply)
      ~ create_date           = "2023-02-13T21:48:18Z" -> (known after apply)
      ~ id                    = "SentinelForwarderLambda-github-secret-scanning" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::283582579564:policy/SentinelForwarderLambda-github-secret-scanning",
        ] -> (known after apply)
      ~ name                  = "SentinelForwarderLambda-github-secret-scanning" -> "SentinelForwarderLambda-github-secret-scanning-sentinel" # forces replacement
      + name_prefix           = (known after apply)
      - tags                  = {} -> null
      ~ tags_all              = {} -> (known after apply)
      ~ unique_id             = "AROAUEBWWYNWJTV6WROXT" -> (known after apply)
        # (4 unchanged attributes hidden)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.sentinel_forwarder.aws_iam_role_policy_attachment.sentinel_forwarder_lambda must be replaced
-/+ resource "aws_iam_role_policy_attachment" "sentinel_forwarder_lambda" {
      ~ id         = "SentinelForwarderLambda-github-secret-scanning-20230213214818979800000001" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::283582579564:policy/SentinelForwarderLambda-github-secret-scanning" -> (known after apply) # forces replacement
      ~ role       = "SentinelForwarderLambda-github-secret-scanning" -> "SentinelForwarderLambda-github-secret-scanning-sentinel" # forces replacement
    }

  # module.sentinel_forwarder.aws_lambda_function.sentinel_forwarder must be replaced
-/+ resource "aws_lambda_function" "sentinel_forwarder" {
      ~ architectures                  = [
          - "x86_64",
        ] -> (known after apply)
      ~ arn                            = "arn:aws:lambda:ca-central-1:283582579564:function:github-secret-scanning" -> (known after apply)
      - code_signing_config_arn        = "" -> null
      ~ function_name                  = "github-secret-scanning" -> "github-secret-scanning-sentinel" # forces replacement
      ~ id                             = "github-secret-scanning" -> (known after apply)
      - image_uri                      = "" -> null
      ~ invoke_arn                     = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:283582579564:function:github-secret-scanning/invocations" -> (known after apply)
      - kms_key_arn                    = "" -> null
      ~ last_modified                  = "2023-02-13T21:48:38.190+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:283582579564:function:github-secret-scanning:$LATEST" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:283582579564:function:github-secret-scanning:$LATEST/invocations" -> (known after apply)
      ~ role                           = "arn:aws:iam::283582579564:role/SentinelForwarderLambda-github-secret-scanning" -> (known after apply)
      ~ signing_job_arn                = "" -> (known after apply)
      ~ signing_profile_version_arn    = "" -> (known after apply)
      ~ source_code_size               = 300 -> (known after apply)
        tags                           = {
            "CostCentre" = "github-secret-scanning-production"
        }
      ~ version                        = "$LATEST" -> (known after apply)
        # (12 unchanged attributes hidden)

      ~ ephemeral_storage {
          ~ size = 512 -> (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

  # module.sentinel_forwarder.aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[0] must be replaced
-/+ resource "aws_lambda_permission" "sentinel_forwarder_cloudwatch_log_subscription" {
      ~ function_name       = "github-secret-scanning" -> "github-secret-scanning-sentinel" # forces replacement
      ~ id                  = "AllowExecutionFromCloudWatchLogs-github-secret-scanning-0" -> (known after apply)
      ~ statement_id        = "AllowExecutionFromCloudWatchLogs-github-secret-scanning-0" -> "AllowExecutionFromCloudWatchLogs-github-secret-scanning-sentinel-0" # forces replacement
      + statement_id_prefix = (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 6 to add, 0 to change, 5 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_cloudwatch_log_group.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_iam_policy.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_iam_role.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_lambda_function.sentinel_forwarder"]

21 tests, 17 passed, 4 warnings, 0 failures, 0 exceptions

```

</details>
